// TODO list:
// 	-> delete files/directories
// 	-> data stream shrinking
// 	-> sparse files
// 	-> hard/symbolic links
// 	-> journal
//	-> checksums
//	-> directory indexing
//	-> check program
//	-> indirect 3
//	-> block error handling

#ifndef KERNEL
#include <stdio.h>
#include <unistd.h>
#include <dirent.h>
#include <string.h>
#include <stdlib.h>
#include <stdbool.h>
#include <stdint.h>
#include <sys/types.h>
#include <sys/stat.h>

#define ESFS_HEADER
#define ESFS_IMPLEMENTATION
#define ESFS_UTITILES

struct UniqueIdentifier {
	uint8_t d[16];
};
#endif

#ifdef ESFS_HEADER

// Volume format:
// 	- Boot block (always 8KiB)		) Core data
// 	- Superblock (always 8Kib)		)
// 	- Group descriptor table		)
// 	- Metadata files			)
// 	- Block groups (block usage extents, data blocks)
// 	- Superblock backup

#define ESFS_MAX_BLOCK_SIZE (16384)

// The boot block and superblock are EACH 8KiB.
#define ESFS_BOOT_SUPER_BLOCK_SIZE (8192)

#define ESFS_DRIVER_VERSION (2)
#define ESFS_DRIVE_MINIMUM_SIZE (1048576)

#define ESFS_MAXIMUM_VOLUME_NAME_LENGTH (32)

#define ESFS_SIGNATURE_STRING        ("EssenceFS!     \0")
#define ESFS_SIGNATURE_STRING_LENGTH (16)

struct EsFSLocalExtent {
	uint16_t offset;				// The offset in blocks from the first block in the group.
	uint16_t count;					// The number of blocks described by the extent.
};

struct EsFSGlobalExtent {
	uint64_t offset;				// The offset in blocks from the first block in the volume.
	uint64_t count;					// The number of blocks described by the extent.
};

struct EsFSSuperblock {
	// Version 1

/*0*/	char signature[ESFS_SIGNATURE_STRING_LENGTH];	// The filesystem signature; should be ESFS_SIGNATURE_STRING.
/*16*/	char volumeName[ESFS_MAXIMUM_VOLUME_NAME_LENGTH]; // The name of the volume.
/**/	
/*48*/	uint16_t requiredReadVersion;			// If this is greater than the driver's version, then the filesystem cannot be read.
/*50*/	uint16_t requiredWriteVersion;			// If this is greater than the driver's version, then the filesystem cannot be written.
/**/	
/*52*/	uint8_t mounted;				// Non-zero to indicate that the volume is mounted, or was not properly unmounted.
/**/	
/*56*/	uint64_t blockSize;				// The size of a block on the volume.
/*64*/	uint64_t blockCount;				// The number of blocks on the volume.
/*72*/	uint64_t blocksUsed;				// The number of blocks that are in use.
/**/	
/*80*/	uint16_t blocksPerGroup;			// The number of blocks in a group.
/*88*/	uint64_t groupCount;				// The number of groups on the volume.
/*96*/	uint64_t blocksPerGroupExtentTable;		// The number of blocks used to a store a group's extent table.
/**/	
/*104*/	EsFSLocalExtent gdt;				// The group descriptor table's location.
/*108*/	EsFSLocalExtent rootDirectoryFileEntry;		// The file entry for the root directory.
/*112*/	EsFSLocalExtent kernelFileEntry;		// The file entry for the kernel.
/**/	
/*116*/	UniqueIdentifier identifier;			// The unique identifier for the volume.
/*132*/	UniqueIdentifier osInstallation;		// The unique identifier of the Essence installation this volume was made for.
							// If this is zero, then the volume is not an Essence installation volume.
};

struct EsFSGroupDescriptor {
	uint64_t extentTable;				// The first block containing the extent table.
							// This is usually at the start of the group.
							// If this is 0 then there is no extent table, and no blocks in the group are used.
							// As the worst case for a fully merged table in a group will be blocks per group / 2 and each LocalExtent is 2 bytes,
							// the maximum size of an extent table will be (blocks per group) bytes.
							// This will therefore be the size of the table.

	uint16_t extentCount;				// The number of extents in the extent table of the group.
							
	uint16_t blocksUsed;				// The number of used blocks in this group.

	// TODO Maybe store the size of the largest extent in the group here?
};

struct EsFSAttributeHeader {
#define ESFS_ATTRIBUTE_LIST_END (0xFFFF)		// Used to mark the end of an attribute list.

#define ESFS_ATTRIBUTE_FILE_SECURITY (1)		// Contains the security information relating to the item.
#define ESFS_ATTRIBUTE_FILE_DATA (2)			// Contains a data stream of the file.
#define ESFS_ATTRIBUTE_FILE_DIRECTORY (3)		// Contains information about a directory file.

#define ESFS_ATTRIBUTE_DIRECTORY_NAME (1)		// Contains the name of the file in the directory.
#define ESFS_ATTRIBUTE_DIRECTORY_FILE (2)		// Contains the file entry embedded in the directory.
							// TODO Hard links.

	uint16_t type;
	uint16_t size;
};

struct EsFSAttributeFileSecurity {
	// If this attribute does not exist, the file inherits its permissions from its parent.

	EsFSAttributeHeader header;

	UniqueIdentifier owner;				// The identifier of the account/program that owns this file/directory.
							// The identifier is only valid if this drive is running on the specified installation.
							// If this field is 0, then there is no assigned owner.
};

struct EsFSAttributeFileData {
/*0*/	EsFSAttributeHeader header;

#define ESFS_STREAM_DEFAULT  (0) // The normal data stream for a file.
/*4*/	uint8_t stream;					// The stream this data describes.

#define ESFS_DATA_INDIRECT   (1)
#define ESFS_DATA_INDIRECT_2 (2) 
#define ESFS_DATA_INDIRECT_3 (3)
#define ESFS_DATA_DIRECT     (4)
/*5*/	uint8_t indirection;				// The level of indirection needed to read the data.

/*6*/	uint16_t extentCount;				// The number of extents describing the file.

/*8*/	uint64_t size;					// The size of the data in the stream in bytes.

/*16*/	union {
		// TODO Change the size of this depending on the block size?

#define ESFS_INDIRECT_EXTENTS (4)
		EsFSGlobalExtent indirect[ESFS_INDIRECT_EXTENTS]; // Extents that contain the stream's data.
	
#define ESFS_INDIRECT_2_EXTENTS (8)
		uint64_t indirect2[ESFS_INDIRECT_2_EXTENTS];	// Blocks that contain lists of extents that contain the stream's data.

#define ESFS_DIRECT_BYTES (64)
		uint8_t direct[ESFS_DIRECT_BYTES];		// The actual file data, inline.
	};
};

struct EsFSAttributeFileDirectory {
	EsFSAttributeHeader header;

	uint64_t itemsInDirectory;			// The number of items that the directory currently holds.
	uint16_t spaceAvailableInLastBlock;		// Since directory entries must not span over a block boundary,
							// we should keep track of whether we need to resize the directory
							// to insert a new directory entry.
};

struct EsFSAttributeDirectoryName {
	EsFSAttributeHeader header;

	uint8_t nameLength;
	// Name follows.
};

struct EsFSFileEntry {
	// The size of a file entry must be less than the size of a block.
	// File entries may not span over a block boundary.

#define ESFS_FILE_ENTRY_SIGNATURE "FileEsFS"
/*0*/	char signature[8];				// Must be ESFS_FILE_ENTRY_SIGNATURE.

/*8*/	UniqueIdentifier identifier;

#define ESFS_FILE_TYPE_FILE (1)
#define ESFS_FILE_TYPE_DIRECTORY (2)
#define ESFS_FILE_TYPE_SYMBOLIC_LINK (3)
/*24*/	uint8_t fileType;

/*32*/	uint64_t creationTime;				// TODO Decide the format for times?
/*40*/	uint64_t modificationTime;

/*48*/	// EsFSAttributes follow.
};

struct EsFSAttributeDirectoryFile {
	EsFSAttributeHeader header;
	
	// FileEntry follows.
};

struct EsFSDirectoryEntry {
#define ESFS_DIRECTORY_ENTRY_SIGNATURE "DirEntry"
	char signature[8];				// Must be ESFS_DIRECTORY_ENTRY_SIGNATURE.

	// EsFSAttributes follow.
};

struct EsFSSuperblockP {
	EsFSSuperblock d;
	char p[ESFS_BOOT_SUPER_BLOCK_SIZE - sizeof(EsFSSuperblock)];	// The P means padding.
};

struct EsFSGroupDescriptorP {
	EsFSGroupDescriptor d;
	char p[32 - sizeof(EsFSGroupDescriptor)];
};

struct EsFSLoadInformation {
	uint64_t containerBlock;
	uint64_t positionInBlock;
};

#endif 

#ifdef ESFS_IMPLEMENTATION

// GLOBAL VARIABLES

FILE *randomFile;
FILE *drive;

uint64_t blockSize;
uint64_t partitionOffset;
EsFSSuperblockP superblockP;
EsFSSuperblock *superblock = &superblockP.d;
EsFSGroupDescriptorP *groupDescriptorTable;

uint8_t entryBuffer[ESFS_MAX_BLOCK_SIZE];			// Temporary buffers.
